xbenkozx/RAZ-RE/Firmware/keil-mdk/firmware/n32g031_std_periph_driver/inc/n32g031_rcc.h
/*****************************************************************************
 * Copyright (c) 2019, Nations Technologies Inc.
 *
 * All rights reserved.
 * ****************************************************************************
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Nations' name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY NATIONS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL NATIONS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ****************************************************************************/

/**
 * @file n32g031_rcc.h
 * @author Nations
 * @version v1.0.0
 *
 * @copyright Copyright (c) 2019, Nations Technologies Inc. All rights reserved.
 */
#ifndef __N32G031_RCC_H__
#define __N32G031_RCC_H__

#ifdef __cplusplus
extern "C" {
#endif

#include "n32g031.h"

/** @addtogroup N32G031_StdPeriph_Driver
 * @{
 */

/** @addtogroup RCC
 * @{
 */

/** @addtogroup RCC_Exported_Types
 * @{
 */

typedef struct
{
    uint32_t SysclkFreq;    /*!< returns SYSCLK clock frequency expressed in Hz */
    uint32_t HclkFreq;      /*!< returns HCLK clock frequency expressed in Hz */
    uint32_t Pclk1Freq;     /*!< returns PCLK1 clock frequency expressed in Hz */
    uint32_t Pclk2Freq;     /*!< returns PCLK2 clock frequency expressed in Hz */
    uint32_t AdcPllClkFreq; /*!< returns ADCPLLCLK clock frequency expressed in Hz */
    uint32_t AdcHclkFreq;   /*!< returns ADCHCLK clock frequency expressed in Hz */
} RCC_ClocksType;

/**
 * @}
 */

/** @addtogroup RCC_Exported_Constants
 * @{
 */

/** @addtogroup HSE_configuration
 * @{
 */

#define RCC_HSE_DISABLE     ((uint32_t)0x00000000)
#define RCC_HSE_ENABLE      ((uint32_t)0x00010000)
#define RCC_HSE_BYPASS      ((uint32_t)0x00040000)
#define IS_RCC_HSE(HSE) (((HSE) == RCC_HSE_DISABLE) || ((HSE) == RCC_HSE_ENABLE)           \
                      || ((HSE) == RCC_HSE_BYPASS))

/**
 * @}
 */

/** @addtogroup HSI_configuration
 * @{
 */

#define RCC_HSI_DISABLE ((uint32_t)0x00000000)
#define RCC_HSI_ENABLE  ((uint32_t)0x00000001)
#define IS_RCC_HSI(HSI) (((HSI) == RCC_HSI_DISABLE) || ((HSI) == RCC_HSI_ENABLE))

/**
 * @}
 */

/** @addtogroup PLL_entry_clock_source
 * @{
 */

#define RCC_PLL_SRC_HSI ((uint32_t)0x00000000)
#define RCC_PLL_SRC_HSE ((uint32_t)0x01000000)
#define RCC_PLL_SRC_BP  ((uint32_t)0x00400000)
#define IS_RCC_PLL_SRC(SOURCE)                                                                               \
    (((SOURCE) == RCC_PLL_SRC_HSI) || ((SOURCE) == RCC_PLL_SRC_HSE)                                          \
  || ((SOURCE) == RCC_PLL_SRC_BP))

#define RCC_PLLOUT_DIV_1  ((uint32_t)0x00000000)
#define RCC_PLLOUT_DIV_2  ((uint32_t)0x00400000)
#define RCC_PLLOUT_DIV_3  ((uint32_t)0x00800000)
#define RCC_PLLOUT_DIV_4  ((uint32_t)0x00C00000)
#define IS_RCC_PLLOUT_DIV(DIV)                                                                               \
       (((DIV) == RCC_PLLOUT_DIV_1) || ((DIV) == RCC_PLLOUT_DIV_2) || ((DIV) == RCC_PLLOUT_DIV_3)            \
     || ((DIV) == RCC_PLLOUT_DIV_4))

/**
 * @}
 */

/** @addtogroup PLL_multiplication_factor
 * @{
 */
#define RCC_PLL_MUL_3  ((uint32_t)0x00000000)
#define RCC_PLL_MUL_4  ((uint32_t)0x00010000)
#define RCC_PLL_MUL_5  ((uint32_t)0x00020000)
#define RCC_PLL_MUL_6  ((uint32_t)0x00030000)
#define RCC_PLL_MUL_7  ((uint32_t)0x00040000)
#define RCC_PLL_MUL_8  ((uint32_t)0x00050000)
#define RCC_PLL_MUL_9  ((uint32_t)0x00060000)
#define RCC_PLL_MUL_10 ((uint32_t)0x00070000)
#define RCC_PLL_MUL_11 ((uint32_t)0x00080000)
#define RCC_PLL_MUL_12 ((uint32_t)0x00090000)
#define RCC_PLL_MUL_13 ((uint32_t)0x000A0000)
#define RCC_PLL_MUL_14 ((uint32_t)0x000B0000)
#define RCC_PLL_MUL_15 ((uint32_t)0x000C0000)
#define RCC_PLL_MUL_16 ((uint32_t)0x000D0000)
#define RCC_PLL_MUL_17 ((uint32_t)0x000E0000)
#define RCC_PLL_MUL_18 ((uint32_t)0x000F0000)
#define IS_RCC_PLL_MUL(MUL)                                                                     \
       (((MUL) == RCC_PLL_MUL_3)  || ((MUL) == RCC_PLL_MUL_4)  || ((MUL) == RCC_PLL_MUL_5)      \
     || ((MUL) == RCC_PLL_MUL_6)  || ((MUL) == RCC_PLL_MUL_7)  || ((MUL) == RCC_PLL_MUL_8)      \
     || ((MUL) == RCC_PLL_MUL_9)  || ((MUL) == RCC_PLL_MUL_10) || ((MUL) == RCC_PLL_MUL_11)     \
     || ((MUL) == RCC_PLL_MUL_12) || ((MUL) == RCC_PLL_MUL_13) || ((MUL) == RCC_PLL_MUL_14)     \
     || ((MUL) == RCC_PLL_MUL_15) || ((MUL) == RCC_PLL_MUL_16) || ((MUL) == RCC_PLL_MUL_17)     \
     || ((MUL) == RCC_PLL_MUL_18))

/**
 * @}
 */

/** @addtogroup PLL_PreDivider_factor
 * @{
 */
#define RCC_PLL_PRE_1  ((uint32_t)0x00000000)
#define RCC_PLL_PRE_2  ((uint32_t)0x00100000)
#define RCC_PLL_PRE_3  ((uint32_t)0x00200000)
#define RCC_PLL_PRE_4  ((uint32_t)0x00300000)
#define IS_RCC_PLL_PRE(PRE)                                                                     \
       (((PRE) == RCC_PLL_PRE_1)  || ((PRE) == RCC_PLL_PRE_2)  || ((PRE) == RCC_PLL_PRE_3)      \
     || ((PRE) == RCC_PLL_PRE_4))

/**
 * @}
 */

/** @addtogroup System_clock_source
 * @{
 */

#define RCC_SYSCLK_SRC_HSI    ((uint32_t)0x00000000)
#define RCC_SYSCLK_SRC_HSE    ((uint32_t)0x00000001)
#define RCC_SYSCLK_SRC_PLLCLK ((uint32_t)0x00000002)
#define RCC_SYSCLK_SRC_LSE    ((uint32_t)0x00000003)
#define RCC_SYSCLK_SRC_LSI    ((uint32_t)0x00000004)
#define IS_RCC_SYSCLK_SRC(SOURCE)                                                                                      \
    (((SOURCE) == RCC_SYSCLK_SRC_HSI) || ((SOURCE) == RCC_SYSCLK_SRC_HSE)                                              \
  || ((SOURCE) == RCC_SYSCLK_SRC_PLLCLK) || ((SOURCE) == RCC_SYSCLK_SRC_LSE)                                           \
  || ((SOURCE) == RCC_SYSCLK_SRC_LSI))
/**
 * @}
 */

/** @addtogroup AHB_clock_source
 * @{
 */

#define RCC_SYSCLK_DIV1   ((uint32_t)0x00000000)
#define RCC_SYSCLK_DIV2   ((uint32_t)0x00000080)
#define RCC_SYSCLK_DIV4   ((uint32_t)0x00000090)
#define RCC_SYSCLK_DIV8   ((uint32_t)0x000000A0)
#define RCC_SYSCLK_DIV16  ((uint32_t)0x000000B0)
#define RCC_SYSCLK_DIV64  ((uint32_t)0x000000C0)
#define RCC_SYSCLK_DIV128 ((uint32_t)0x000000D0)
#define RCC_SYSCLK_DIV256 ((uint32_t)0x000000E0)
#define RCC_SYSCLK_DIV512 ((uint32_t)0x000000F0)
#define IS_RCC_SYSCLK_DIV(HCLK)                                                                                        \
    (((HCLK) == RCC_SYSCLK_DIV1) || ((HCLK) == RCC_SYSCLK_DIV2) || ((HCLK) == RCC_SYSCLK_DIV4)                         \
     || ((HCLK) == RCC_SYSCLK_DIV8) || ((HCLK) == RCC_SYSCLK_DIV16) || ((HCLK) == RCC_SYSCLK_DIV64)                    \
     || ((HCLK) == RCC_SYSCLK_DIV128) || ((HCLK) == RCC_SYSCLK_DIV256) || ((HCLK) == RCC_SYSCLK_DIV512))
/**
 * @}
 */

/** @addtogroup APB1_APB2_clock_source
 * @{
 */

